In [1]:
import pandas as pd

In [5]:
df = pd.read_csv("employees.csv")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null object
Start Date           1000 non-null object
Last Login Time      1000 non-null object
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    933 non-null object
Team                 957 non-null object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [9]:
df["Start Date"].head(3)

0     8/6/1993
1    3/31/1996
2    4/23/1993
Name: Start Date, dtype: object

In [11]:
df["Start Date"] = pd.to_datetime(df["Start Date"])
df["Start Date"].head(3)

0   1993-08-06
1   1996-03-31
2   1993-04-23
Name: Start Date, dtype: datetime64[ns]

In [12]:
df["Last Login Time"].head(3)

0    12:42 PM
1     6:53 AM
2    11:17 AM
Name: Last Login Time, dtype: object

In [13]:
df["Last Login Time"] = pd.to_datetime(df["Last Login Time"])
df["Last Login Time"].head(3)

0   2019-09-29 12:42:00
1   2019-09-29 06:53:00
2   2019-09-29 11:17:00
Name: Last Login Time, dtype: datetime64[ns]

In [14]:
df["Senior Management"] = df["Senior Management"].astype("bool")

In [15]:
df["Gender"] = df["Gender"].astype("category")

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

In [18]:
# In short we can do this

df = pd.read_csv("employees.csv", parse_dates=["Start Date", "Last Login Time"])

df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")

df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-09-29 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-09-29 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2019-09-29 11:17:00,130590,11.858,False,Finance

### Filter a DatFrame Based On A Condition

In [29]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-09-29 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-09-29 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2019-09-29 11:17:00,130590,11.858,False,Finance

In [21]:
df["Gender"] == "Male"

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996     True
997     True
998     True
999     True
Name: Gender, Length: 1000, dtype: bool

In [22]:
df[df["Gender"] == "Male"]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-09-29 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-09-29 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2019-09-29 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2019-09-29 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2019-09-29 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2019-09-29 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2019-09-29 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2019-09-29 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2019-09-29 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2019-09-29 18:24:00,129949,10.169,True,Sales

In [32]:
# A more elegant way to do this

mask = (df["Team"] == "Finance")
df[mask].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2019-09-29 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2019-09-29 13:00:00,138705,9.340,True,Finance
7,NaN,Female,2015-07-20,2019-09-29 10:43:00,45906,11.598,True,Finance

In [26]:
df["Senior Management"]

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996    False
997    False
998    False
999     True
Name: Senior Management, Length: 1000, dtype: bool

In [38]:
mask = (df["Team"] != "Marketing")
df[mask].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2019-09-29 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2019-09-29 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2019-09-29 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2019-09-29 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2019-09-29 01:35:00,115163,10.125,False,Legal

In [47]:
mask = (df["Salary"] > 110000)

mask = (df["Bonus %"] < 1.5)
df[mask].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
4,Larry,Male,1998-01-24,2019-09-29 16:47:00,101004,1.389,True,Client Services
15,Lillian,Female,2016-06-05,2019-09-29 06:09:00,59414,1.256,False,Product
58,Theresa,Female,2010-04-11,2019-09-29 07:18:00,72670,1.481,True,Engineering
77,Charles,Male,2004-09-14,2019-09-29 20:13:00,107391,1.260,True,Marketing
175,Willie,Male,1998-02-17,2019-09-29 20:20:00,146651,1.451,True,Engineering

In [50]:
# Emplyees who started working before 1985
mask = (df["Start Date"] < "1985-01-01")
df[mask].head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,1980-08-12,2019-09-29 09:01:00,63241,15.132,True,NaN
12,Brandon,Male,1980-12-01,2019-09-29 01:08:00,112807,17.492,True,Human Resources
18,Diana,Female,1981-10-23,2019-09-29 10:27:00,132940,19.082,False,Client Services
28,Terry,Male,1981-11-27,2019-09-29 18:30:00,124008,13.464,True,Client Services
37,Linda,Female,1981-10-19,2019-09-29 20:49:00,57427,9.557,True,Client Services

### Filter with More than One Condition (AND)